src/Catalogs/ЗД_ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗД_ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортАгентаСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРазрешения</Name>
					<Comment>При установленной блокировки в 1Сv8*</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВременныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжиданияОтключения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКПлатформе1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезапускКластера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключенияБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКRAC</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скрипт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗД_Скрипты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Хранилище</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗД_Хранилища</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛогинХранилища</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольХранилища</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ОбновлениеСервер/Ext/Module.bsl
Процедура ОбновлениеИзХранилищаПоРасписанию(ИБ) Экспорт
	
    Справочники.ЗД_ИнформационныеБазы.ПакетСкриптов_Запуск_СерверНаСервере(ИБ);
	
КонецПроцедуры

Процедура ОбновитьБазуИзХранилища(ИБ) Экспорт
//ИБ = Справочники.ИнформационныеБазы.СоздатьЭлемент();

	Попытка
		
		ИзменитьБлокировкуСеансов(ИБ, Истина);

		Пауза(ИБ.ВремяОжиданияОтключения);
		
		//поиск кластера
		Попытка
			КоннекторКластера = Новый COMОбъект("V83.COMConnector");
			ИдентификаторАгента = "tcp://"+ИБ.ИмяСервера+":"+ИБ.ПортАгентаСервера;
			СоединениеСАгентом = КоннекторКластера.ConnectAgent(ИдентификаторАгента);
			СоединениеСАгентом.AuthenticateAgent("","");			
		Исключение
			ТекстСообщения = ИдентификаторАгента + ОписаниеОшибки();
			УведомитьОбОшибке(ТекстСообщения,ИБ);
			Возврат;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ИБ.ПортКластера) Тогда
			ПортКластера = Число(ИБ.ПортКластера); 
		Иначе
			ПортКластера = 1541; 
		КонецЕсли;
		
		Кластер = Неопределено;
		КластерНайден = Ложь;
		Кластеры = СоединениеСАгентом.GetClusters();
		Для каждого Кластер Из Кластеры Цикл
			Если Кластер.MainPort = Число(ПортКластера) Тогда
				СоединениеСАгентом.Authenticate(Кластер, "", "");
				КластерНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если не КластерНайден Тогда
			ТекстСообщения = "Не найден кластер "+ ИБ.ИмяСервера+":"+ИБ.ПортКластера;
			УведомитьОбОшибке(ТекстСообщения,ИБ);
			Возврат;		
		КонецЕсли;
		
		//поиск базы
		InfoBases = СоединениеСАгентом.GetInfoBases(Кластер);
		БазаНайдена = Ложь;
		Для каждого iBase Из InfoBases Цикл
			Если iBase.Name = ИБ.ИмяБазы Тогда
				БазаНайдена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не БазаНайдена Тогда
			УведомитьОбОшибке("В кластере не найдена БД "+ИБ.ИмяБазы, ИБ);
			Возврат;
		КонецЕсли;
		
		//блокировка регламентных заданий, установить через рабочий процесс
		ПараметрыБлокировкиРегламентныхЗаданий = Новый Структура();
		ПараметрыБлокировкиРегламентныхЗаданий.Вставить("КоннекторКластера",КоннекторКластера);
		ПараметрыБлокировкиРегламентныхЗаданий.Вставить("СоединениеСАгентом",СоединениеСАгентом);
		ПараметрыБлокировкиРегламентныхЗаданий.Вставить("Кластер",Кластер);
		ПараметрыБлокировкиРегламентныхЗаданий.Вставить("ИБ",ИБ);
		ПараметрыБлокировкиРегламентныхЗаданий.Вставить("ЗначениеБлокировки",Истина);
		
		ИзменитьБлокировкуРегламентныхЗаданий(ПараметрыБлокировкиРегламентныхЗаданий);
		
		Пауза(ИБ.ВремяОжиданияОтключения);
		
		#Область ЗавершениеСеансов
		Если ОстановитьИсполнение() Тогда
			Возврат;
		КонецЕсли; 
		ТекстСообщения = ИБ.Наименование+Символы.ПС+" Завершение сеансов";
		ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстСообщения);
		
		Sessions = СоединениеСАгентом.GetInfoBaseSessions(Кластер, iBase);
		Для каждого Session Из Sessions Цикл
			СоединениеСАгентом.TerminateSession(Кластер, Session, "Завершение сеанса при обновлении из хранилища");
		КонецЦикла;
		Пауза(1);
		
		//проверка не завершенных
		ОсталосьПопыток = 3;
		Sessions = СоединениеСАгентом.GetInfoBaseSessions(Кластер, iBase);
		МассивЗависших = Sessions.Выгрузить();
		Пока МассивЗависших.Количество() <> 0 и ОсталосьПопыток > 0 Цикл
			
			ТекстЗависших = "";
			Для каждого Сеанс Из МассивЗависших Цикл
				СеансИнфо = СтрШаблон("AppID=%1, Host=%2, userName=%3",
									Сеанс.AppID,
									Сеанс.Host,
									Сеанс.userName);
				ТекстЗависших = ТекстЗависших +СеансИнфо+Символы.ПС;
			КонецЦикла;
			ЗаписьЖурналаРегистрации("Обновление из хранилища",,,ТекстЗависших,"Сброс зависших сеансов, осталось попыток "+ОсталосьПопыток);
			
			Для каждого Session Из Sessions Цикл
				СоединениеСАгентом.TerminateSession(Кластер, Session, "Завершение сеанса при обновлении из хранилища");
			КонецЦикла;
			Пауза(1);
			
			ОсталосьПопыток = ОсталосьПопыток-1;
		КонецЦикла;
		
		#КонецОбласти
		
		#Область ПерезапускКластера
		//альтернативный перезапуск кластера
		//- завершить старые процессы
		//- поднять новые 
		//- при этом допустимые сеансы других баз переходят на новые процессы
		//- завершить старые процессы вместе с зависшими сеансами и соединениями
		//- вернуть исходные значения
		//
		//N.B.! следует понимать гарантированного пути перезапустить процессы одного кластера вендор не предоставляет
		//правила игры периодически меняются, рекомендации и методы кластера перестают работать
		
		Если ИБ.ПерезапускКластера Тогда
			
			//сбросить зависшие сеансы
			//все что мягко не завершилось через функции БСП - сбрасывается перезапуском сеансов
			Если ОстановитьИсполнение() Тогда
				Возврат;
			КонецЕсли; 
			ТекстСообщения = ИБ.Наименование+Символы.ПС+" Перезапуск рабочих процессов кластера";
			ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстСообщения);
			
			НачальныеПараметрыКластера = Новый Структура("LifeTimeLimit, ExpirationTimeout, KillProblemProcesses");//, 
			ЗаполнитьЗначенияСвойств(НачальныеПараметрыКластера,Кластер);
			
			Попытка
				
				СисИнфо = Новый СистемнаяИнформация;
				Если СисИнфо.ВерсияПриложения >= "8.3.6.1977" Тогда
					
					СоединениеСАгентом.SetClusterRecyclingByTime(Кластер, 60);
					СоединениеСАгентом.SetClusterRecyclingExpirationTimeout(Кластер, 10);
					СоединениеСАгентом.SetClusterRecyclingKillProblemProcesses(Кластер, Истина);
					
					Пауза(1); 
					
					//возвращаем прошлые значения
					СоединениеСАгентом.SetClusterRecyclingByTime(Кластер, НачальныеПараметрыКластера.LifeTimeLimit);
					СоединениеСАгентом.SetClusterRecyclingExpirationTimeout(Кластер, НачальныеПараметрыКластера.ExpirationTimeout);
					СоединениеСАгентом.SetClusterRecyclingKillProblemProcesses(Кластер, НачальныеПараметрыКластера.KillProblemProcesses);
					
				ИначеЕсли СисИнфо.ВерсияПриложения >= "8.3.14.1565" Тогда
					
					Кластер.LifeTimeLimit = 30;	//перезапуск процессов
					Кластер.ExpirationTimeout = 10; //принудительное завершение выключенных 
					Кластер.KillProblemProcesses = Истина; //принудительное завершение проблемных
						
					Пауза(5); 
					
					ЗаполнитьЗначенияСвойств(Кластер, НачальныеПараметрыКластера);
				
				КонецЕсли;
			
			Исключение
				
				ТекстСообщения = ИБ.Наименование+Символы.ПС+" Ошибка перезапуска кластера"+Символы.ПС+ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстСообщения);
				
			КонецПопытки;
			
		КонецЕсли;
		
		#КонецОбласти

		#Область ПакетныйРежим
		//пакетный режим - обновить из хранилища
		Если ОстановитьИсполнение() Тогда
			Возврат;
		КонецЕсли; 
		ТекстСообщения = ИБ.Наименование+Символы.ПС+" Пакетный режим - обновить из хранилища";
		ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстСообщения);
		
		Если ЗначениеЗаполнено(ИБ.КаталогВременныхФайлов) Тогда
			КаталогВременныхФайлов = ИБ.КаталогВременныхФайлов;
		Иначе
			КаталогВременныхФайлов = КаталогВременныхФайлов();	
		КонецЕсли;
		
		логКонсоли =  КаталогВременныхФайлов+"stdOut.txt";
		ПутьКПлатформе1С = ИБ.ПутьКПлатформе1С;
		wsh = новый COMОбъект("WScript.Shell");
		
		квч = Символ(34);
		МассивКоманды = Новый Массив;
		МассивКоманды.Добавить(квч+ПутьКПлатформе1С+квч);
		МассивКоманды.Добавить("DESIGNER");
		МассивКоманды.Добавить("/DisableStartupMessages");
		МассивКоманды.Добавить("/S"+ИБ.ИмяСервера+?(ИБ.ПортКластера="","",":"+ИБ.ПортКластера)+"\"+ИБ.ИмяБазы);
		Если ЗначениеЗаполнено(ИБ.ЛогинБазы) Тогда
			МассивКоманды.Добавить("/N"+квч+ИБ.ЛогинБазы+квч);
		КонецЕсли;
		Если ЗначениеЗаполнено(ИБ.ПарольБазы) Тогда
			МассивКоманды.Добавить("/P"+квч+ИБ.ПарольБазы+квч);
		КонецЕсли;
		
		МассивКоманды.Добавить("/ConfigurationRepositoryF "+ИБ.КаталогХранилища);
		Если ЗначениеЗаполнено(ИБ.ЛогинХранилища) Тогда
			МассивКоманды.Добавить("/ConfigurationRepositoryN  "+квч+ИБ.ЛогинХранилища+квч);
		КонецЕсли;
		Если ЗначениеЗаполнено(ИБ.ПарольХранилища) Тогда
			МассивКоманды.Добавить("/ConfigurationRepositoryP "+квч+ИБ.ПарольХранилища+квч);
		КонецЕсли;
		
		МассивКоманды.Добавить("/ConfigurationRepositoryUpdateCfg -revised -force");
		МассивКоманды.Добавить("/UpdateDBCfg");
		МассивКоманды.Добавить("/Out "+квч+логКонсоли+квч);
		МассивКоманды.Добавить("/UC"+ИБ.КодРазрешения);
		
		СтрокаЗапуска = СтрСоединить(МассивКоманды," ");
		
		Если ИБ.Отладка Тогда
			СтрокаКоманды = КаталогВременныхФайлов+"Start1C.cmd";
			ТелоКоманды = Новый ТекстовыйДокумент;
			ТелоКоманды.УстановитьТекст(СтрокаЗапуска);
			ТелоКоманды.Записать(СтрокаКоманды,КодировкаТекста.OEM);
		Иначе
			СтрокаКоманды = СтрокаЗапуска;
		КонецЕсли;
		
		//ВыполнитьКомандуСистемыСОжиданием(ПутьКФайлуКоманды);
		
		КодВозврата = wsh.Run(СтрокаКоманды, 0, 1);
		Если КодВозврата <> 0 Тогда
			УведомитьОбОшибке("Ошибка выполнения пакетного запуска, код возврата "+ КодВозврата, ИБ);
		КонецЕсли;
		
		//содержимое лога
		ФайлЛог = Новый Файл(логКонсоли);
		Если ФайлЛог.Существует() Тогда
			текстЛог = Новый ТекстовыйДокумент;		
			текстЛог.Прочитать(логКонсоли);
			СодержаниеЛога = текстЛог.ПолучитьТекст();
		Иначе
			СодержаниеЛога = "Ошибка обработки лога";
		КонецЕсли;
		#КонецОбласти
		
		//снять все блокировки
		ИзменитьБлокировкуСеансов(ИБ, Ложь);
		
		ПараметрыБлокировкиРегламентныхЗаданий.ЗначениеБлокировки = Ложь;
		ИзменитьБлокировкуРегламентныхЗаданий(ПараметрыБлокировкиРегламентныхЗаданий);
		

		//проверка пустого лога
		ЭталонПустогоЛога = Константы.ЭталонПустогоЛога.Получить();
		Если Не ЗначениеЗаполнено(ЭталонПустогоЛога) Тогда
			ЭталонПустогоЛога =
			"---- Начало операции с хранилищем конфигурации ----
			|---- Операция с хранилищем конфигурации завершена ----
			|Обновление конфигурации из хранилища успешно завершено";
		КонецЕсли; 
		ПустойЛог = СокрЛП(СодержаниеЛога) = СокрЛП(ЭталонПустогоЛога);
		
		//ЖурналОбновлений.ПустойЛог = ПустойЛог;
		//ЖурналОбновлений.Записать();
		
		Если не ПустойЛог Тогда
			ОтправитьПисьмо(СодержаниеЛога, ИБ);
		КонецЕсли;
		
		//для аварийного перезапуска\повтора Регламентного Задания обновления ИБ в соотв. с настройками
		Если КодВозврата <> 0 Тогда
			ВызватьИсключение("Перезапуск задания, код возврата "+КодВозврата); 
		КонецЕсли;
		
	Исключение
		//снять все блокировки
		ИзменитьБлокировкуСеансов(ИБ, Ложь);
		
		ПараметрыБлокировкиРегламентныхЗаданий.ЗначениеБлокировки = Ложь;
		ИзменитьБлокировкуРегламентныхЗаданий(ПараметрыБлокировкиРегламентныхЗаданий);
		
		УведомитьОбОшибке("Общая ошибка исполнения "+ОписаниеОшибки(), ИБ);
		
		ВызватьИсключение; //для аварийного перезапуска РЗ
	КонецПопытки;
	
КонецПроцедуры

Процедура ИзменитьБлокировкуСеансов(ИБ, ЗначениеБлокировки)
	
	//после сброса сеансов \ перезапуска кластера надо заново подключаться к базе по com
	Коннектор = ПолучитьComConnector1С8(ИБ);
	Если Коннектор = Неопределено Тогда
		//уведомить об ошибке уже в ПолучитьComConnector1С8
		Возврат;
	КонецЕсли;
	
	ПараметрыБлокировкиСеансов = Коннектор.ПолучитьБлокировкуСеансов();
	
	Если ЗначениеБлокировки = Истина Тогда
		
		ПараметрыБлокировкиСеансов.Начало 			= ТекущаяДата();
		ПараметрыБлокировкиСеансов.Конец  			= ТекущаяДата()+3600;
		ПараметрыБлокировкиСеансов.Сообщение 		= "Регламентное обновление базы из хранилища";
		ПараметрыБлокировкиСеансов.КодРазрешения 	= ИБ.КодРазрешения;	
		
	КонецЕсли;
	
	ПараметрыБлокировкиСеансов.Установлена 		= ЗначениеБлокировки;
	Коннектор.УстановитьБлокировкуСеансов(ПараметрыБлокировкиСеансов);
	
	ТекстСообщения = ИБ.Наименование+Символы.ПС+" Блокировка сеансов "+ЗначениеБлокировки;
	ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстСообщения);
		
КонецПроцедуры

//изменяет блокировку регламентных заданий
Процедура ИзменитьБлокировкуРегламентныхЗаданий(ПБ)
	
	РабочиеПроцессы = ПБ.СоединениеСАгентом.GetWorkingProcesses(ПБ.Кластер);
	ИнформационнаяБазаТекущая = Неопределено;
	Для Каждого РабочийПроцесс Из РабочиеПроцессы Цикл
		СоединениеСРабочимПроцессом = ПБ.КоннекторКластера.ConnectWorkingProcess("tcp://"+РабочийПроцесс.HostName+":"+Формат(РабочийПроцесс.MainPort,"ЧГ=0"));
		СоединениеСРабочимПроцессом.AddAuthentication(ПБ.ИБ.ЛогинБазы, ПБ.ИБ.ПарольБазы);
		МассивИнформационныхБаз = СоединениеСРабочимПроцессом.GetInfoBases();
		Для Каждого ИнформационнаяБаза Из МассивИнформационныхБаз Цикл
			Если Нрег(ИнформационнаяБаза.Name) = Нрег(ПБ.ИБ.ИмяБазы) тогда
				ИнформационнаяБазаТекущая = ИнформационнаяБаза;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если ИнформационнаяБазаТекущая = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ИнформационнаяБазаТекущая.ScheduledJobsDenied = ПБ.ЗначениеБлокировки;
	СоединениеСРабочимПроцессом.UpdateInfoBase(ИнформационнаяБазаТекущая);
	
	ТекстСообщения = ПБ.ИБ.Наименование+Символы.ПС+" Блокировки регламентных заданий "+ПБ.ЗначениеБлокировки;
	ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстСообщения);
	
КонецПроцедуры

//На клиенте или сервере, от контекста вызова
Функция ПолучитьComConnector1С8(ИБ)

	// Создание объекта-коннектора
	Попытка
		cntr = Новый COMObject("V83.COMConnector");
	Исключение
		#Если Клиент Тогда
		    КонтекстВызова = "в контексте клиента " + ИмяКомпьютера(); 	
		#ИначеЕсли Сервер Тогда
			КонтекстВызова = "в контексте СЕРВЕРА " + ИмяКомпьютера(); 	 	
		#КонецЕсли
		
		ТекстСообщения = "Ошибка создания объекта COMConnector " + Символы.ПС + 
			КонтекстВызова + Символы.ПС + 
			ОписаниеОшибки();
		УведомитьОбОшибке(ТекстСообщения, ИБ);
		Возврат Неопределено;
	КонецПопытки;
	
	квч = Символ(34);
	СтрокаПодключения =	
	"Srvr="+квч+ИБ.ИмяСервера+?(ИБ.ПортКластера="","",":"+ИБ.ПортКластера)+квч+
	";Ref="+квч+ИБ.ИмяБазы+квч+
	";Usr="+квч+ИБ.ЛогинБазы+квч+
	";Pwd="+квч+ИБ.ПарольБазы+квч;
	Если Не ПустаяСтрока(ИБ.КодРазрешения) Тогда
		СтрокаПодключения = СтрокаПодключения + ";UC="+ИБ.КодРазрешения;
	КонецЕсли;
	
	Попытка
		cntn = cntr.Connect(СтрокаПодключения);
	Исключение
		ТекстСообщения = "Не удалось подключиться к базе данных " + Символы.ПС + 
			СтрокаПодключения + Символы.ПС + 
			ОписаниеОшибки();
		УведомитьОбОшибке(ТекстСообщения, ИБ);
		Возврат Неопределено;
	КонецПопытки;

	Возврат cntn;

КонецФункции // ПолучитьComConnector1С8()

Процедура УведомитьОбОшибке(ТекстСообщения, ИБ)

	ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,"Ошибка обновления "+ Символы.ПС + ТекстСообщения);
	ОтправитьПисьмо(ТекстСообщения, ИБ);
	Сообщить(ТекстСообщения,СтатусСообщения.Важное);
	
КонецПроцедуры

//пауза в 1С, длительность в мин.
Процедура Пауза(ДлительностьМинут) Экспорт
	
	Секунд = ДлительностьМинут*60;
	Для к=1 По Секунд Цикл
		
		Если ОстановитьИсполнение() Тогда
			Прервать;
		КонецЕсли; 
		
		СтрокаЗапроса = "ping -n 2 localhost"; 
		Соединение = Новый COMОбъект("WScript.Shell");
		Соединение.Run(СтрокаЗапроса, 0, -1);	
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьНастройкиПочты() Экспорт
	ХранилищеНастроек = Константы.НастройкаПочты.Получить();
	ПараметрыПочты = ХранилищеНастроек.Получить();
	Возврат ПараметрыПочты;
КонецФункции

//ПараметрыПисьма
//	ТекстСообщения
//	Получатели - массив строк с адресами
//	ФайлОтчетов - путь к файлу
Процедура ОтправитьПисьмо(знач ТекстПисьма, ИБ) Экспорт
	
	//почта 
	ПараметрыПочты = ПолучитьНастройкиПочты();
	Если не ЗначениеЗаполнено(ПараметрыПочты) Тогда
		ТекстОшибки = "Ошибка отправки почтовой рассылки "+ Символы.ПС + "Не заданы настройки почтового сервера";
		ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстОшибки);
		Сообщить(ТекстОшибки,СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ПараметрыПочты.Тема = ПараметрыПочты.Тема+" - "+ИБ.ИмяБазы ;
	
	Профиль = новый ИнтернетПочтовыйПрофиль;
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации[ПараметрыПочты.АутентификацияSMTP];
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	ЗаполнитьЗначенияСвойств(Сообщение,ПараметрыПочты);
	
	//получатели
	Отбор = Новый Структура("Отправлять",Истина);
	тзПолучатели = ИБ.ПолучателиУведомлений.НайтиСтроки(Отбор);
	Для каждого СтрокаПолучатель Из тзПолучатели Цикл
		Сообщение.Получатели.Добавить(СтрокаПолучатель.Получатель);
	КонецЦикла;
	
	Сообщение.Тексты.Добавить(ТекстПисьма);
	
	//Если ЗначениеЗаполнено(ФайлОтчетов) Тогда
	//	Сообщение.Вложения.Добавить(ФайлОтчетов);
	//КонецЕсли;
	
	Почта = Новый ИнтернетПочта;
	Попытка 
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
		
	Исключение
		
		//УведомитьОбОшибке(ТекстОшибки, ИБ); - зациклится
		
		ТекстОшибки = "Ошибка отправки почтовой рассылки "+ Символы.ПС + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстОшибки);
		Сообщить(ТекстОшибки,СтатусСообщения.Важное);
		
	КонецПопытки;   
	
КонецПроцедуры

Процедура ВыполнитьКомандуСистемыСОжиданием(Команда)
    ScrptCtrl=Новый COMОбъект("MSScriptControl.ScriptControl");
    ScrptCtrl.Language="vbscript";
    ScrptCtrl.AddCode("
    |Function ExecSys()
    |Dim oWsh
    |Dim sResult
    |
    |Set oWsh = CreateObject(""Wscript.Shell"")
    |sResult = oWsh.Run(""" + Команда + """, 1, True)
    |
    |End Function
    |");
    Результат = ScrptCtrl.Run("ExecSys");
КонецПроцедуры

Функция ОстановитьИсполнение()
	
	Если Константы.ОстановитьИсполнение.Получить() = Истина Тогда
		
		ТекстСообщения = "Выполнение остановлено пользователем через константу";
		ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстСообщения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
